In [2]:
import pandas as pd
import numpy as np

In [3]:
temperatures = np.array([
    [25, 28.5, 30],
    [33, 29, 35],
    [38, 39, 44],
])

# Def des index et colonnes
temperatures_df = pd.DataFrame(
    temperatures,
    index = ['Bordeaux', 'Paris', 'Lille'],
    columns = ['2001', '2002', '2003']
)

In [4]:
temperatures_df

          2001  2002  2003
Bordeaux  25.0  28.5  30.0
Paris     33.0  29.0  35.0
Lille     38.0  39.0  44.0

In [5]:
temperatures_df.head(1)

          2001  2002  2003
Bordeaux  25.0  28.5  30.0

In [6]:
temperatures_df.tail(1)

       2001  2002  2003
Lille  38.0  39.0  44.0

In [7]:
dataset = {
    'name':['john','mary','peter','jeff','bill','lisa','jose'],
    'age':[23,78,22,19,45,33,20],
    'gender':['M','F','M','M','M','F','M'],
    'city':[
        'Paris','Lille',
        'Paris','Lille','Paris',
        'Bordeaux','Bordeaux'
    ],
    'num_children':[3,0,2,4,3,1,5],
    'num_pet':[5,1,0,5,2,2,3]
}

df = pd.DataFrame(dataset)
df.head(7)

    name  age gender      city  num_children  num_pet
0   john   23      M     Paris             3        5
1   mary   78      F     Lille             0        1
2  peter   22      M     Paris             2        0
3   jeff   19      M     Lille             4        5
4   bill   45      M     Paris             3        2
5   lisa   33      F  Bordeaux             1        2
6   jose   20      M  Bordeaux             5        3

In [8]:
df['city']

0       Paris
1       Lille
2       Paris
3       Lille
4       Paris
5    Bordeaux
6    Bordeaux
Name: city, dtype: object

In [15]:
df[ ['city', 'num_pet' ]]

       city  num_pet
0     Paris        5
1     Lille        1
2     Paris        0
3     Lille        5
4     Paris        2
5  Bordeaux        2
6  Bordeaux        3

In [16]:
df[0:2]

   name  age gender   city  num_children  num_pet
0  john   23      M  Paris             3        5
1  mary   78      F  Lille             0        1

In [18]:
df

    name  age gender      city  num_children  num_pet
0   john   23      M     Paris             3        5
1   mary   78      F     Lille             0        1
2  peter   22      M     Paris             2        0
3   jeff   19      M     Lille             4        5
4   bill   45      M     Paris             3        2
5   lisa   33      F  Bordeaux             1        2
6   jose   20      M  Bordeaux             5        3

In [23]:
df.loc[3:5, 'name' : 'city']

   name  age gender      city
3  jeff   19      M     Lille
4  bill   45      M     Paris
5  lisa   33      F  Bordeaux

In [ ]:
# Création de DataFrame

"""
---------------------------------
|   |   Rapsberry | Cherries    |
---------------------------------
| 0 |   30        |  20         |
---------------------------------
"""

In [26]:
df = pd.DataFrame({
    'Rapsberry' : [30],
    'Cherries' : [20]
})

df

   Rapsberry  Cherries
0         30        20

In [28]:
"""
------------------------------------
|       |   fig       |     wine    |
------------------------------------
| 2020  |   130       |  120        |
------------------------------------
| 2019  |   309       |  290        |
------------------------------------
"""

df = pd.DataFrame({
    'fig' : [130, 309],
    'wine' : [120, 290]
}, index=[2020, 2019])

df

      fig  wine
2020  130   120
2019  309   290

In [37]:
# Rempalcez les données manquantes par np.nam
df = pd.DataFrame(
    [
        [1, "2", None, 3],
        [4, None, "5", 6],
        [7, 8, 9, 10],
        ["None", "", None, "NAN"],
    ],
    index=['a', 'b', 'c', 'd'],
    columns = ['A', 'B', 'C', 'D']
)

ddf = df.replace('', np.nan)  # copie

ddf

      A     B     C    D
a     1     2  None    3
b     4  None     5    6
c     7     8     9   10
d  None   NaN  None  NAN

In [38]:
df # source de vérité non modifiée

      A     B     C    D
a     1     2  None    3
b     4  None     5    6
c     7     8     9   10
d  None        None  NAN

In [39]:
# inplace 
df.replace(['', 'None', 'NAN', None], np.nan, inplace=True)


df

     A    B    C     D
a  1.0    2  NaN   3.0
b  4.0  NaN    5   6.0
c  7.0    8    9  10.0
d  NaN  NaN  NaN   NaN

In [41]:
df.drop('d', inplace=True)

df

     A    B    C     D
a  1.0    2  NaN   3.0
b  4.0  NaN    5   6.0
c  7.0    8    9  10.0

In [55]:
df.isnull()

       A      B      C      D
a  False  False   True  False
b  False   True  False  False
c  False  False  False  False

In [56]:
df.shape

(3, 4)

In [57]:
df.isnull().shape

(3, 4)

In [58]:
# Afficher les/la ligne(s) qui ne possède(nt) pas de valeur NaN
# Afficher toutes les valeurs différente de NaN du DataFrame
# Combien y a t il de valeur(s) qui ne sont/n'est pas NaN

In [116]:
# Par exemple ce mask affichera la première et la dernière ligne du DataFrame
mask = df.notnull().all(axis=1)

df[mask]

     A  B  C     D
c  7.0  8  9  10.0

In [120]:
# Meilleur approche avec dropna()
df.dropna()

     A  B  C     D
c  7.0  8  9  10.0

In [79]:
( v for v in line for line in df.valu)

A    3
B    2
C    2
D    3
dtype: int64

In [124]:
# Combien y a t il de valeur(s) qui ne sont/n'est pas NaN
df.notnull().sum().sum()

10

In [128]:
# Une autre solution
np.where(pd.notnull(df))[0].size

10